In [2]:
import os
os.putenv("NLS_LANG", "KOREAN_KOREA.KO16KSC5601")
import cx_Oracle
import pandas as pd
import numpy as np

In [3]:
conn = cx_Oracle.connect('team/1234@192.168.0.52:32764/xe', encoding='utf-8')
df = pd.read_sql("SELECT article_id, article_date FROM article_article WHERE article_content like '%코로나%' and article_date >= 20200101 and article_date <= 20200401", conn)
df.head()

           ARTICLE_ID ARTICLE_DATE
0  105_011_0003688312     20200201
1  105_215_0000843890     20200201
2  105_018_0004566641     20200201
3  105_018_0004566630     20200201
4  105_018_0004566624     20200201

In [5]:
df['timestamp'] = pd.to_datetime(df["ARTICLE_DATE"],format='%Y%m%d', errors='ignore')
df['year'] = df["timestamp"].dt.year
df['month'] = df["timestamp"].dt.month
df['day'] = df["timestamp"].dt.day
df.head()

           ARTICLE_ID ARTICLE_DATE  timestamp  year  month  day
0  105_011_0003688312     20200201 2020-02-01  2020      2    1
1  105_215_0000843890     20200201 2020-02-01  2020      2    1
2  105_018_0004566641     20200201 2020-02-01  2020      2    1
3  105_018_0004566630     20200201 2020-02-01  2020      2    1
4  105_018_0004566624     20200201 2020-02-01  2020      2    1

In [8]:
result_df = df[['ARTICLE_ID', 'day', 'month', 'year']]

In [17]:
month_df = result_df.groupby('month').count()
month_df.head()

       ARTICLE_ID     day    year
month
1           11902   11902   11902
2           78273   78273   78273
3          133258  133258  133258
4            5400    5400    5400

In [20]:
month_df['ARTICLE_ID'].tolist()

[11902, 78273, 133258, 5400]

In [25]:
month_df.index.to_list()

[1, 2, 3, 4]